cf_billing/Documents/энргИзменитьПлательщикаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьПлательщикаУслуги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПлательщикиУслугАбонента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлательщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргИзменитьПлательщикаУслуги/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИзменяемыеПараметрыРасчета() Экспорт
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга","Плательщик"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовИзменитьПлательщикаУслуги";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДляПроведенияПоСтабильнымПериодам()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргИзменитьПлательщикаУслугиПлательщикиСоставныхУслуг.ЧастьСоставнойУслуги, ВложенныйЗапрос.Услуга) КАК Услуга,
	|	ЕСТЬNULL(энргИзменитьПлательщикаУслугиПлательщикиСоставныхУслуг.Плательщик, ВложенныйЗапрос.Плательщик) КАК Плательщик
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		энргИзменитьПлательщикаУслугиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргИзменитьПлательщикаУслугиТочкиУчета.Услуга КАК Услуга,
	|		энргИзменитьПлательщикаУслугиТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|		энргИзменитьПлательщикаУслугиТочкиУчета.Плательщик КАК Плательщик,
	|		энргИзменитьПлательщикаУслугиТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПлательщикаУслуги.ТочкиУчета КАК энргИзменитьПлательщикаУслугиТочкиУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = энргИзменитьПлательщикаУслугиТочкиУчета.Ссылка
	|				И ДокументыДляПроведения.ДокРегистратор = энргИзменитьПлательщикаУслугиТочкиУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПлательщикаУслуги КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргИзменитьПлательщикаУслуги.ПлательщикиСоставныхУслуг КАК энргИзменитьПлательщикаУслугиПлательщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.ДокРегистратор = энргИзменитьПлательщикаУслугиПлательщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргИзменитьПлательщикаУслугиПлательщикиСоставныхУслуг.IDСтроки
	|			И (ВложенныйЗапрос.ЭтоСоставнаяУслуга)";
	
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
